{
  "topics": [
    {
      "type": "mcq",
      "target_weeks": [
        1
      ],
      "difficulty": "easy",
      "topic_description": "Differentiating Machine Learning from traditional programming paradigms based on how rules and data are handled."
    },
    {
      "type": "mcq",
      "target_weeks": [
        1
      ],
      "difficulty": "easy",
      "topic_description": "Identifying the primary goal and typical applications of Supervised Learning."
    },
    {
      "type": "mcq",
      "target_weeks": [
        1,
        2
      ],
      "difficulty": "medium",
      "topic_description": "Understanding the concept of the 'Curse of Dimensionality' and its implications in Machine Learning."
    },
    {
      "type": "mcq",
      "target_weeks": [
        2
      ],
      "difficulty": "easy",
      "topic_description": "Defining and identifying examples of discrete vs. continuous random variables."
    },
    {
      "type": "mcq",
      "target_weeks": [
        2
      ],
      "difficulty": "medium",
      "topic_description": "Applying the product rule or sum rule of probability in a simple scenario."
    },
    {
      "type": "mcq",
      "target_weeks": [
        2
      ],
      "difficulty": "hard",
      "topic_description": "Interpreting the meaning and application of Cross-Entropy or KL Divergence in the context of machine learning models."
    },
    {
      "type": "mcq",
      "target_weeks": [
        3
      ],
      "difficulty": "easy",
      "topic_description": "Distinguishing between regression and classification problems based on the nature of the output variable."
    },
    {
      "type": "mcq",
      "target_weeks": [
        3
      ],
      "difficulty": "medium",
      "topic_description": "Understanding the role of the learning rate in Gradient Descent and its impact on convergence."
    },
    {
      "type": "mcq",
      "target_weeks": [
        3
      ],
      "difficulty": "hard",
      "topic_description": "Comparing Gradient Descent and the Normal Equation for linear regression, considering their computational complexity and applicability."
    },
    {
      "type": "mcq",
      "target_weeks": [
        4
      ],
      "difficulty": "medium",
      "topic_description": "Differentiating between Maximum A Posteriori (MAP) and Maximum Likelihood Estimation (MLE)."
    },
    {
      "type": "mcq",
      "target_weeks": [
        4
      ],
      "difficulty": "medium",
      "topic_description": "Identifying the key assumption of the Naïve Bayes classifier (conditional independence)."
    },
    {
      "type": "mcq",
      "target_weeks": [
        5
      ],
      "difficulty": "medium",
      "topic_description": "Calculating Gini Index or Entropy for a given node in a decision tree to measure impurity."
    },
    {
      "type": "mcq",
      "target_weeks": [
        6
      ],
      "difficulty": "medium",
      "topic_description": "Explaining the purpose of the Kernel Trick in SVMs for handling non-linear classification problems."
    },
    {
      "type": "mcq",
      "target_weeks": [
        7
      ],
      "difficulty": "easy",
      "topic_description": "Identifying the visual characteristics and causes of overfitting in a machine learning model."
    },
    {
      "type": "mcq",
      "target_weeks": [
        8
      ],
      "difficulty": "medium",
      "topic_description": "Comparing the strengths and weaknesses of K-Means, Hierarchical Agglomerative Clustering (HAC), and DBSCAN for different data characteristics."
    }
  ]
}